Modul 6/PRAK601/app/Controllers/AuthController.php

    public function doLogin() {
        $model = new UserModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $user = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'Bima'
 LIMIT 1