Modul 6/PRAK601/app/Controllers/BookController.php

    public function index() {
        $model = new BookModel();
        $data['books'] = $model->findAll();
---
SELECT *
FROM `books`

    public function edit($id) {
        // Pengecekan login
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Login terlebih dahulu!');
        }
        helper('form');
        $model = new BookModel();
        $data['book'] = $model->find($id);
---
SELECT *
FROM `books`
WHERE `books`.`id` = '1'